examples/twophaseflux/dustyBox/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 300;

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
