examples/twophaseflux/dustyBox/Allrun
#!/usr/bin/env bash
case_dir="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
source "$(git -C "$(dirname "${BASH_SOURCE[0]}")" rev-parse --show-toplevel)/scripts/openfoam10-env.sh"
set -euo pipefail
cd "${case_dir}"

if [[ "${1:-}" == "--check" ]]; then
    test -f constant/ugkwpProperties
    test -f reference/case_parameters.json
    PYTHONDONTWRITEBYTECODE=1 python3 -m py_compile postprocess.py
    echo "配置检查通过：dustyBox"
    exit 0
fi
[[ $# -eq 0 ]] || { echo "用法：./Allrun [--check]" >&2; exit 2; }
if pgrep -f '(^|/)GpuGkp([[:space:]]|$)|(^|/)gpu26CudaBackend([[:space:]]|$)' >/dev/null; then
    echo "错误：已有 GPU2.6 计算正在运行。" >&2
    exit 1
fi
./Allclean
export GPU26_CUDA_BACKEND="${FOAM_USER_APPBIN}/gpu26CudaBackend"
blockMesh > log.blockMesh 2>&1
/usr/bin/time -f 'elapsed_seconds=%e' -o runtime.gpu2.6 \
    "${FOAM_USER_APPBIN}/GpuGkp" > log.gpu2.6 2>&1
PYTHONDONTWRITEBYTECODE=1 python3 postprocess.py
